Revit.Elements.FamilyParameter.SpecType
Get the parameter's spec type

Revit.Elements.FamilyParameter.GroupType
Get the parameter's group type

Revit.Elements.FamilyParameter.Unit
Get the Parameter's Unit Type